Repository: th-otto/AtariX
Catalog: src/AtariX-*/AtariX/*.lproj/Localizable.strings
Languages: de

source: Add
de: Anhängen

source: All files and folders were successfully copied to the Atari boot drive directory.
de: Alle Dateien und Verzeichnisse wurde erfolgreich ins Atari-Bootlaufwerk kopiert.

source: Atari boot drive successfully created
de: Das Atari-Bootlaufwerk wurde erfolgreich erstellt.

source: Cancel
de: Abbrechen

source: Choose Atari Root-FS Directory (Boot Drive)
de: Bitte Atari-Root-FS (Boot-Laufwerk) auswählen!

source: Close
de: Schließen

source: Create directory MAGIC_C inside the provided path?
de: Soll das Verzeichnis MAGIC_C im ausgewählten Pfad erstellt werden?

source: Create or Revert
de: Erstellen oder Zurücksetzen

source: Do not add
de: Nicht anhängen

source: Not all files and folders could be copied successfully. Your Atari boot drive may be incomplete.
de: Nicht alle Dateien und Ordner konnten erfolgreich kopiert werden. Das Atari-Bootlaufwerk ist möglicherweise unvollständig.

source: Overwrite files inside the provided directory?
de: Bestehende Dateien im Verzeichnis überschreiben?

source: The Atari Root-Fs is incomplete, and the screen driver is missing.
de: Das Atari-Dateisystem ist möglicherweise unvollständig, und die Treiberdatei fehlt.

source: The Atari kernel is missing.
de: Die Datei mit dem Atari-Kernel fehlt.

source: No file with name "MagicMacX.OS" found in the application directory.
de: Keine Datei mit dem Namen "MagicMacX.OS" im Programmpaket gefunden.

source: Not enough memory.
de: Zuwenig Speicher.

source: The Atari kernel is damaged.
de: Die Atari-Kerneldatei ist beschädigt.

source: The file "MagicMacX.OS" has been modified.
de: Die Datei "MagicMacX.OS" wurde verändert.

source: The Atari emulator has to be restarted.
de: Der Atari-Emulator muß neu gestartet werden.

source: The changes to the settings cannot be applied at runtime.
de: Die Änderungen an den Einstellungen können nicht im Betrieb übernommen werden.

source: The Atari emulator will be terminated immediately.
de: Der Atari-Emulator wird sofort beendet.

source: The Atari emulator is a Demo-version.
de: Der Atari-Emulator ist eine Demo-Version.

source: Write access is disabled in the Demo-version.
de: Schreibzugriffe sind in der Demo-Version deaktiviert.

source: The screen size has been adjusted automatically.
de: Die Bildschirmgröße wurde automatisch korrigiert.

source: The Atari emulator needs a minimum screen size of 320x200 pixel.
de: Der Atari-Emulator benötigt mindestens 320 mal 200 Bildpunkte.

source: The directory must be named MAGIC_C. It will appear as virtual drive C: inside the virtual machine.
de: Das Verzeichnis muß MAGIC_C heißen. Es erscheint als Laufwerk C: im virtuellen Atari.

source: The path provided does not end with directory MAGIC_C. It should be added automatically.
de: Der ausgewählte Pfad endet nicht mit einem Verzeichnis MAGIC_C. Dieses Verzeichnis sollte automatisch angehängt werden.

source: There were errors during creation.
de: Während des Erstellens sind Fehler aufgetreten.

source: You are going to create or revert the Atari boot drive. Existing files or directories inside the same directory will be overwritten.
de: Sie sind dabei, das Atari-Bootlaufwerk zu erstellen bzw. zurückzusetzen. Bestehende Dateien und Verzeichnisse werden überschrieben.
